Olusola Ogun

CSS 455

Assignment #3

In [2]:
# Reference Materials
import pandas as pd
import config

def sql_update(query):
    # Execute Statment
    query = (query)
    try:
        config.cursor.execute(query)
    except Exception as ex:
        if str(ex) == 'ORA-00955: name is already used by an existing object':
            pass#print ('Table previously created')
        else:
            pass
    #Create and save to query to SQL file
    #f = open("{}".format(filename), "a+")
    #f.write(query + ';')
    #f.close()
# Create Tables needed for the assignment, for personal reference only
query = [
         'create table park_grades(grade_id int primary key, grade_name varchar2(10), min_price varchar2(30), max_price varchar2(30))',
         'create table packages(pack_id int primary key, speed int, strt_date date, monthly_payment int, sector_id int)',
         'create table sectors(sector_id int primary key, sector_name varchar2(10))',
         'create table customers(customer_id int primary key, first_name varchar2(20), last_name varchar2(20), birth_date date, join_date date, city varchar2(30), state varchar2(30), \
          street varchar2(30), main_phone_num int, secondary_phone_num int, fax int, monthly_discount int, pack_id int)' 
        ]
for i in query:
    sql_update(i)

#### Part 1
1. Cities and the average monthly discount (Customers table) â€“
 - Display the city and the average monthly discount for each city
     - **SELECT AVG(monthly_payment) , city FROM customers GROUP BY city**
 - Display the city and the average monthly discount for each city, only for the customers whose monthly discount is greater than 20 
     - **SELECT MIN(monthly_discount) , city FROM customers GROUP BY city HAVING min(monthly_discount) > 20**
2. States and the lowest monthly discount (Customers table)
 - Display the state and the lowest monthly discount for each state
     - **SELECT MIN(monthly_discount) , state FROM customers GROUP BY state**
 - Display the state and lowest monthly discount for each state, only for states where the lowest monthly discount is greater than 10
     - **SELECT MIN(monthly_discount) , state FROM customers GROUP BY state HAVING min(monthly_discount) > 10**
3. The number of customer in each internet package (Customers table)
 - Display the package number and the number of customers for each package number.
     - **SELECT COUNT(DISTINCT speed) FROM packages** 
 - Modify the query to display the package number and number of customers for each package number, only for the customers whose monthly discount is greater than 20
     - **SELECT pack_id , COUNT(*) FROM customers WHERE monthly_discount > 20 GROUP BY pack_id**
 - Modify the query to display the package number and number of customers for each package number, only for the packages with more than 100 customers
     - **SELECT pack_id , COUNT(*) FROM customers GROUP BY pack_id HAVING COUNT(*) > 100**
4. Customers and internet packages (Customers & Packages tables)
 - Write a query to display first name, last name, package number and internet speed for all customer
     - **SELECT cust.last_name , cust.first_name , cust.pack_id , pack.speed FROM customers cust JOIN packages pack ON cust.pack_id = pack.pack_id **
 - Write a query to display first name, last name, package number and internet speed for all customers whose package number equals 22 or 27. Order the query in ascending order by last name
     - **SELECT cust.last_name , cust.first_name , cust.pack_id , pack.speed FROM customers cust JOIN packages pack ON cust.pack_id = pack.pack_id WHERE cust.pack_id IN (27, 22) ORDER BY
     cust.last_name**
5. Internet packages and sectors
 - Display the package number, internet speed, monthly payment and sector name for all packages (Packages and Sectors tables)
     - **SELECT pack.pack_id , pack.speed, pack.monthly_payment, sect.sector_name FROM packages pack JOIN sectors sect ON pack.sector_id = sect.sector_id **
 - Display the customer name, package number, internet speed, monthly payment and sector name for all customers in the business sector (Customers, Packages and Sectorstables)
     - **SELECT cust.last_name , cust.first_name , pack.pack_id , pack.speed, pack.monthly_payment, sect.sector_name FROM packages pack JOIN sectors sect ON pack.sector_id = sect.sector_id
     JOIN customers cust ON cust.pack_id = pack.pack_id WHERE sect.sector_name = 'Business'**
6. Customers and internet packages (Customers and Packages tables)
 - Display the first name, last name, internet speed and monthly payment for all customers. Use INNER JOIN to solve this exercise
     - **SELECT cust.last_name , cust.first_name ,  pack.speed , pack.monthly_payment FROM customers cust JOIN packages pack ON cust.pack_id = pack.pack_id**
 - Modify last query to display all customers, including those without any internet package
    - **SELECT cust.last_name , cust.first_name ,  pack.speed , pack.monthly_payment FROM customers cust LEFT OUTER JOIN packages pack ON cust.pack_id = pack.pack_id**
 - Modify last query to display all packages, including those without any customers
    - **SELECT cust.last_name , cust.first_name ,  pack.speed , pack.monthly_payment FROM customers cust RIGHT OUTER JOIN packages pack ON cust.pack_id = pack.pack_id**
 - Modify last query to display all packages and all customers
    - **SELECT cust.last_name , cust.first_name ,  pack.speed , pack.monthly_payment FROM customers cust FULL OUTER JOIN packages pack ON cust.pack_id = pack.pack_id**

#### Part 2

1. Create the Person table.  Person(person_id,first_name,last_name) Primary Key: person_id; All the other fields are required
    - **CREATE TABLE Persons (person_id int NOT NULL,first_name varchar(255) NOT NULL,last_name varchar(255),PRIMARY KEY (person_id))**
2. Create the Building table. Building (building_id,building_name) Primary Key: building_id; All the other fields are required
    - **CREATE TABLE Building (building_id int NOT NULL,building_name varchar(255) NOT NULL,PRIMARY KEY (building_id))**
3. Create the Room table. Room(room_id, room_number, building_id, capacity) Primary Key: room_id; All the other fields are required
    - **CREATE TABLE Room (room_id int NOT NULL,room_number varchar(255) NOT NULL,building_id varchar(255) NOT NULL,capacity int NOT NULL,PRIMARY KEY (room_id),FOREIGN KEY (building_id) REFERENCES Building(building_id))**
4. Create the Meeting table. Meeting (meeting_id,room_id,meeting_start,meeting_end) Primary Key: meeting_id; ; All the other fields are required
    - **CREATE TABLE Meeting (meeting_id int NOT NULL,room_id int NOT NULL,meeting_start varchar(255) NOT NULL,meeting_end varchar(255) NOT NULL,PRIMARY KEY (meeting_id),FOREIGN KEY (room_id) REFERENCES Room(room_id))**
5. Create the Person-Meeting intersection table. Person_meeting(person_id,meeting_id) Primary Key: person_id, meeting_id
    - **CREATE TABLE PersonMeeting (person_id int NOT NULL,meeting_id int NOT NULL,FOREIGN KEY (person_id) REFERENCES Persons(person_id),FOREIGN KEY (meeting_id) REFERENCES meeting(person_id))**
6. Insert the below data in the Person table (Tom, Hanks) (Anne, Hathaway) (Tom, Cruise) (Meryl, Streep) (Chris, Pratt) (Halle, Berry) (Robert, De Niro) (Julia, Roberts) (Denzel, "Washington) (Melissa, McCarthy)
    - **insert into Person (first_name,last_name) values (Tom, Hanks)**
    - **insert into Person (first_name,last_name) values (Anne, Hathaway)**
    - **insert into Person (first_name,last_name) values (Tom, Cruise)**
    - **insert into Person (first_name,last_name) values (Meryl, Streep)**
    - **insert into Person (first_name,last_name) values (Chris, Pratt)**
    - **insert into Person (first_name,last_name) values (Halle, Berry)**
    - **insert into Person (first_name,last_name) values (Robert, De Niro)**
    - **insert into Person (first_name,last_name) values (Julia, Roberts)**
    - **insert into Person (first_name,last_name) values (Denzel, "Washington)**
    - **insert into Person (first_name,last_name) values (Melissa, McCarthy)**
7. Insert the below data in the Building table (Headquarters) (Main Street Building)
    - **insert into Building (building_name) values (Headquarters)**
    - **insert into Building (building_name) values (Main Street Building)**
8. Insert the below data in the Room table (room_number, building_id, capacity) (100, 1, 5) (200, 1, 4) (300, 1, 10) (10, 2, 4) (20, 2, 4)
    - **insert into Room (room_number, building_id, capacity) values (100, 1, 5)**
    - ** insert into Room (room_number, building_id, capacity) values (200, 1, 4)**
    - **insert into Room (room_number, building_id, capacity) values (300, 1, 10)**
    - ** insert into Room (room_number, building_id, capacity) values (10, 2, 4)**
    - ** insert into Room (room_number, building_id, capacity) values (20, 2, 4)**
9. Insert the below data in meeting table meeting (room_id, meeting_start, meeting_end) (1, 2016-12-25 09:00:00, 2016-12-25 10:00:00) (1, 2016-12-25 10:00:00, 2016-12-25 12:00:00) (1, 2016-12-25 11:00:00, 2016-12-25 12:00:00) (2, 2016-12-25 09:00:00, 2016-12-25 10:00:00)(4, 2016-12-25 09:00:00, 2016-12-25 10:00:00)(5, 2016-12-25 14:00:00, 2016-12-25 16:00:00)
    - **insert into meeting (room_id, meeting_start, meeting_end) values (1, 2016-12-25 09:00:00, 2016-12-25 10:00:00)**
    - **insert into meeting (room_id, meeting_start, meeting_end) values (1, 2016-12-25 10:00:00, 2016-12-25 12:00:00)**
    - **insert into meeting (room_id, meeting_start, meeting_end) values (1, 2016-12-25 11:00:00, 2016-12-25 12:00:00)**
    - **insert into meeting (room_id, meeting_start, meeting_end) values (2, 2016-12-25 09:00:00, 2016-12-25 10:00:00)**
    - **insert into meeting (room_id, meeting_start, meeting_end) values (4, 2016-12-25 09:00:00, 2016-12-25 10:00:00)**
    - **insert into meeting (room_id, meeting_start, meeting_end) values (5, 2016-12-25 14:00:00, 2016-12-25 16:00:00)**
10. Insert the below data in person_meeting table person_meeting (person_id, meeting_id) (1, 1)(10, 1)(1, 2)(2, 2)(3, 2)(4, 2)(5, 2)(6, 2)(7, 2)(8, 2)(9, 3)(10, 3)(1, 4)(2, 4)(8, 5)(9, 5)(1, 6)(2, 6)(3, 6)
    - **insert into person_meeting (person_id, meeting_id) values (1,1)**
    - **insert into person_meeting (person_id, meeting_id) values (10,1)**
    - **insert into person_meeting (person_id, meeting_id) values (1, 2)**
    - **insert into person_meeting (person_id, meeting_id) values (1,2)**
    - **insert into person_meeting (person_id, meeting_id) values (2,3)**
    - **insert into person_meeting (person_id, meeting_id) values (3,2)**
    - **insert into person_meeting (person_id, meeting_id) values (4,2)**
    - **insert into person_meeting (person_id, meeting_id) values (5,2)**
    - **insert into person_meeting (person_id, meeting_id) values (6,2)**
    - **insert into person_meeting (person_id, meeting_id) values (7,2)**
    - **insert into person_meeting (person_id, meeting_id) values (8,2)**
    - **insert into person_meeting (person_id, meeting_id) values (10,1)**
    - **insert into person_meeting (person_id, meeting_id) values (9,3)**
    - **insert into person_meeting (person_id, meeting_id) values (10,3)**
    - **insert into person_meeting (person_id, meeting_id) values (1,4)**
    - **insert into person_meeting (person_id, meeting_id) values (2,4)**
    - **insert into person_meeting (person_id, meeting_id) values (8,5)**
    - **insert into person_meeting (person_id, meeting_id) values (9,5)**
    - **insert into person_meeting (person_id, meeting_id) values (1,6)**
    - **insert into person_meeting (person_id, meeting_id) values (2,6)**
    - **insert into person_meeting (person_id, meeting_id) values (3,6)**
11. Find all the meetings that Tom Hanks has to attend
    - **select * from meeting where meeting_id in (select meeting_id from person_meeting where person_id in (select person_id from Person where first_name = 'Tom' and last_name = 'Hanks'))**
12. Find all the people that are attending meeting ID 2
    - **select * from Person where person_id in (select person_id from person_meeting where meeting_id = 2)**
11. Find all the people who have meetings in the Main Street building
    - **select * from Person where person_id in (select person_id from person_meeting where meeting_id in (select meeting_id from meeting where room_id in (select room_id from room where uilding_id in(select building_id from building where building_name ='Main Street Building'))))**
12. Find the number of attendees for every meeting
    -  **select meeting_id,sum(capacity) as Attendees from room r,meeting m where r.room_id = m.room_id group by meeting_id**
13. Find All of the People that Have Meetings Only Before Dec. 25, 2016 at Noon Using INNER JOINs
    - **select p.first_name,p.last_name from Person p inner join person_meeting pm where p.person_id = pm.person_id and pm.meeting_id in (select meeting_id from meeting where meeting_end < '2016-12-25 12:00:00')**